Autodesk.Revit.UI.AToastNotificationIcon
The icon type used in the toast notification.
Since:
2020.1
Since:
2020.1

Autodesk.Revit.UI.AToastNotificationIcon.Error
Indicates a failed operation.

Autodesk.Revit.UI.AToastNotificationIcon.Warning
Indicates a warning.

Autodesk.Revit.UI.AToastNotificationIcon.Success
Indicates a successful operation.

Autodesk.Revit.UI.AToastNotificationIcon.Information
Indicates a general information.